#define		_GLOBAL
/*------------------------------------------------------------------------
#	File	: px_jisudat.c
------------------------------------------------------------------------*/

/*------------------------------------------------------------------------
	Header Files
------------------------------------------------------------------------*/
#include	"fep_fepp.h"

/*------------------------------------------------------------------------
	Constants and Structures
------------------------------------------------------------------------*/

/*------------------------------------------------------------------------
	Global Variables
------------------------------------------------------------------------*/

/*------------------------------------------------------------------------
	Function Prototypes
------------------------------------------------------------------------*/

/*----------------------------------------------------------------------*/
int		main (int argc, char *argv[])
/*----------------------------------------------------------------------*/
{
	int		i, idx, rt, len, R_Cnt, flag, start_time, sleep_time;
	char 	buf[5120];
	char    path[128], day[20];
	FILE    *fp;

    if (argc != 1 && argc != 2)
    {
        printf ("==========================================================\n");
        printf ("Usage: %s <date>\n\n", argv[0]);
        printf ("  e.g. 1) %s\n", argv[0]);
        printf ("       2) %s 20090512\n", argv[0]);
        printf ("==========================================================\n");
        exit (FAIL);
    }

    memset (path, 0, sizeof (path));
    memset (day, 0, sizeof (day));

    if (argc == 1 || argc == 2)
    {
        if (argc == 2)
        {
            memcpy (day, argv[1], strlen (argv[1]));
        }
        else
            memcpy (day, "00000000", 8);
    }

	sprintf (path, "%s/PA/%s/pa_7102_dd", (char *)getenv ("_P_DAT"), day);

	if ((fp = fopen (path, "r")) == NULL)
    {
        printf ("\033[5mcannot open:[%s]\033[0m\n", path);
        exit (1);
    }

    while (fgets (buf, sizeof (buf), fp) != NULL)
    {
        if (memcmp (buf+101, "01", 2) != 0)
        {
            memset (buf, 0, sizeof (buf));
            continue;
        }

        if (memcmp (buf+84, "A3", 2) == 0)
		{
			/* 시간(12) + 가격(5) + 체결수량(6) */
			printf ("A3 %12.12s %5.5s %6.6s\n", buf+49, buf+104, buf+109);
		}
        else if (memcmp (buf+84, "G7", 2) == 0)
		{
/* 시간(12),가격(5),체결수량(6),매수1호가(5),매도1호가(5),매수잔량(6*5),매도잔량(6*5),매수건수(4*5),매도건수(4*5)*/
			printf ("G7 %12.12s %5.5s %6.6s %5.5s %5.5s %6.6s %6.6s %6.6s %6.6s %6.6s %6.6s %6.6s %6.6s %6.6s %6.6s %4.4s %4.4s %4.4s %4.4s %4.4s %4.4s %4.4s %4.4s %4.4s %4.4s\n",
				buf+49,  buf+104, buf+109, buf+186, buf+252,
				buf+191, buf+203, buf+215, buf+227, buf+239,
				buf+257, buf+269, buf+281, buf+293, buf+305,
				buf+316, buf+320, buf+324, buf+328, buf+332,
				buf+341, buf+345, buf+349, buf+353, buf+357);
		}
        else if (memcmp (buf+84, "B6", 2) == 0)
		{
/* 시간(12),가격(5),체결수량(6),매수잔량(6*5),매도잔량(6*5),매수건수(4*5),매도건수(4*5)*/
			printf ("B6 %12.12s XXXXX XXXXXX %6.6s %6.6s %6.6s %6.6s %6.6s  %6.6s %6.6s %6.6s %6.6s %6.6s %4.4s %4.4s %4.4s %4.4s %4.4s %4.4s %4.4s %4.4s %4.4s %4.4s\n",
					buf+49, buf+117, buf+129, buf+141, buf+153, buf+165,
					buf+183, buf+195, buf+207, buf+219, buf+231,
					buf+242, buf+246, buf+250, buf+254, buf+258,
					buf+267, buf+271, buf+275, buf+279, buf+283);
		}
		else
        {
            memset (buf, 0, sizeof (buf));
            continue;
        }

        memset (buf, 0, sizeof (buf));
	}
	
	fclose (fp);

	return;
}	/* End of PX_JISUDAT ()	*/

/*************************************************************************
	End of program (px_jisudat.c)
*************************************************************************/ 
